InformationRegisters/ОбращенияПокупателейКлассифицирующаяСистема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОбращенияПокупателейКлассифицирующаяСистема</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДляКлассифицирующейСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветКлассифицирующейСистемы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>id_OK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID_Загрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бланк</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбращенияПокупателейКлассифицирующаяСистема/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Перем мПоказатьДерево;


&НаСервере
Процедура ПакетВДеревоНаСервере(id_OK, GUID_Загрузки, ДатаДок)
	запись = РегистрыСведений.ОбращенияПокупателейКлассифицирующаяСистема.СоздатьМенеджерЗаписи();
	запись.id_OK = id_OK;
	запись.GUID_Загрузки = GUID_Загрузки;
	запись.ДатаДок = ДатаДок;
	
	запись.Прочитать();
	
	Данные = запись.ОтветКлассифицирующейСистемы.Получить();
	
	СтрокуВДеревоНаСервере(Данные);	
КонецПроцедуры

&НаСервере
Процедура СтрокуВДеревоНаСервере(Данные)		
	ДеревоДанных.ПолучитьЭлементы().Очистить();
		
	Попытка	
		ДобавитьУзелВДерево(ДеревоДанных, "Данные", Данные);		
	Исключение
	    Ошибка = ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Ошибка;
		Сообщение.Сообщить();
	КонецПопытки;	
КонецПроцедуры

&НаСервере
Функция ДобавитьУзелВДерево(Родитель, Ключ, Значение)
	Узел = Родитель.ПолучитьЭлементы().Добавить();
	Узел.Ключ = Ключ;
	Узел.Значение = Значение;
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда	
		Для каждого КлючЗначение Из Значение Цикл
			ДобавитьУзелВДерево(Узел, КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
	    Для е = 0 По Значение.Количество() - 1 Цикл
			ДобавитьУзелВДерево(Узел, "[" + е + "]", Значение[е]);
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
		Если мПоказатьДерево = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	мПоказатьДерево = Ложь;
	
	ПодключитьОбработчикОжидания("ПоказатьДерево", 1, Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДерево() Экспорт 
	тд = Элементы.Список.ТекущиеДанные;
	
	Попытка	
		ПакетВДеревоНаСервере(тд.id_OK, тд.GUID_Загрузки, тд.ДатаДок);	
	Исключение
	
	КонецПопытки;
	
	мПоказатьДерево = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуПараметры(Команда)
	ОткрытьФорму("РегистрСведений.ОбращенияПокупателейКлассифицирующаяСистема.Форма.ФормаПараметры");
КонецПроцедуры
